[user@any]$ terraform apply
proxmox_vm_qemu.awo-mon-03: Refreshing state... [id=extsrv-xxxxx/qemu/116]
proxmox_vm_qemu.k3s-ranger-mgmt-02: Refreshing state... [id=extsrv-xxxxx/qemu/117]
proxmox_vm_qemu.awo-un-02: Refreshing state... [id=extsrv-xxxxx/qemu/114]

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # proxmox_vm_qemu.mst01 will be created
  + resource "proxmox_vm_qemu" "mst01" {
      + additional_wait           = 5
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=ide2;scsi0;net0"
      + bootdisk                  = "scsi0"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "Debian Server on K8s-Master with Rancher (res.: awo-rancher)."
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.yyy.xxx/24,gw=192.168.157.1"
      + ipconfig1                 = "ip=192.168.yyy.xxx/24"
      + iso                       = "nfs-xxxxxxxs:iso/Rocky-9.3-x86_64-minimal.iso"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "mst01"
      + nameserver                = "8.8.8.8"
      + onboot                    = true
      + oncreate                  = true
      + os_type                   = "centos"
      + pool                      = "test-pool"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "extsrv-xxxx"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "20480M"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "nfs-xxxxxx"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "vmxnet3"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

  # proxmox_vm_qemu.mst02 will be created
  + resource "proxmox_vm_qemu" "mst02" {
      + additional_wait           = 5
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=ide2;scsi0;net0"
      + bootdisk                  = "scsi0"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "Debian Server on K8s-Master with Rancher (res.: awo-rancher)."
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.yyy.xxxx/24,gw=192.168.yyy.1"
      + ipconfig1                 = "ip=192.168.yyy.131/24"
      + iso                       = "nfs-xxxxx:iso/Rocky-9.3-x86_64-minimal.iso"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "mst02"
      + nameserver                = "8.8.8.8"
      + onboot                    = true
      + oncreate                  = true
      + os_type                   = "centos"
      + pool                      = "test-pool"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "extsrv-xxxxx"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "20480M"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "nfs-xxxxx"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "vmxnet3"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

  # proxmox_vm_qemu.mst03 will be created
  + resource "proxmox_vm_qemu" "mst03" {
      + additional_wait           = 5
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=ide2;scsi0;net0"
      + bootdisk                  = "scsi0"
      + clone_wait                = 10
      + cores                     = 2
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "Debian Server on K8s-Master with Rancher (res.: awo-rancher)."
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.yyy.xxx/24,gw=192.168.yyy.1"
      + ipconfig1                 = "ip=192.168.yyy.xxx/24"
      + iso                       = "nfs-170-isos:iso/Rocky-9.3-x86_64-minimal.iso"
      + kvm                       = true
      + memory                    = 2048
      + name                      = "mst03"
      + nameserver                = "8.8.8.8"
      + onboot                    = true
      + oncreate                  = true
      + os_type                   = "centos"
      + pool                      = "test-pool"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "extsrv-xxxxx"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "20480M"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "nfs-xxxxx"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "vmxnet3"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }
    }

  # proxmox_vm_qemu.wrk01 will be created
  + resource "proxmox_vm_qemu" "wrk01" {
      + additional_wait           = 5
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=ide2;scsi0;net0"
      + bootdisk                  = "scsi0"
      + clone_wait                = 10
      + cores                     = 4
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "Debian Server on K8s-Worker with Rancher (res.: awo-rancher)."
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.yyy.xxx/24,gw=192.168.yyy.1"
      + ipconfig1                 = "ip=192.168.yyy.xxx/24"
      + iso                       = "nfs-170-isos:iso/Rocky-9.3-x86_64-minimal.iso"
      + kvm                       = true
      + memory                    = 8192
      + name                      = "wrk01"
      + nameserver                = "8.8.8.8"
      + onboot                    = true
      + oncreate                  = true
      + os_type                   = "centos"
      + pool                      = "test-pool"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "extsrv-xxxxx"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "20480M"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "nfs-xxxxx"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "vmxnet3"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + vga {
          + type = "std"
        }
    }

  # proxmox_vm_qemu.wrk02 will be created
  + resource "proxmox_vm_qemu" "wrk02" {
      + additional_wait           = 5
      + agent                     = 0
      + automatic_reboot          = true
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "order=ide2;scsi0;net0"
      + bootdisk                  = "scsi0"
      + clone_wait                = 10
      + cores                     = 4
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "Debian Server on K8s-Worker with Rancher (res.: awo-rancher)."
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 100
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.yyy.xxx/24,gw=192.168.yyy.1"
      + ipconfig1                 = "ip=192.168.yyy.xxx/24"
      + iso                       = "nfs-xxxxxs:iso/Rocky-9.3-x86_64-minimal.iso"
      + kvm                       = true
      + memory                    = 8192
      + name                      = "wrk02"
      + nameserver                = "8.8.8.8"
      + onboot                    = true
      + oncreate                  = true
      + os_type                   = "centos"
      + pool                      = "test-pool"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-pci"
      + searchdomain              = (known after apply)
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + target_node               = "extsrv-xxxxx"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = (known after apply)

      + disk {
          + backup             = true
          + cache              = "none"
          + file               = (known after apply)
          + format             = (known after apply)
          + iops               = 0
          + iops_max           = 0
          + iops_max_length    = 0
          + iops_rd            = 0
          + iops_rd_max        = 0
          + iops_rd_max_length = 0
          + iops_wr            = 0
          + iops_wr_max        = 0
          + iops_wr_max_length = 0
          + iothread           = 0
          + mbps               = 0
          + mbps_rd            = 0
          + mbps_rd_max        = 0
          + mbps_wr            = 0
          + mbps_wr_max        = 0
          + media              = (known after apply)
          + replicate          = 0
          + size               = "20480M"
          + slot               = (known after apply)
          + ssd                = 0
          + storage            = "nfs-xxxxx"
          + storage_type       = (known after apply)
          + type               = "scsi"
          + volume             = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "vmxnet3"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = -1
        }

      + vga {
          + type = "std"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "kubernetes_version" but a value
│ was found in file "terraform.tfvars". If you meant to use this value, add a
│ "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain
│ "global" settings to all configurations in your organization. To reduce the
│ verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "cluster_name" but a value was
│ found in file "terraform.tfvars". If you meant to use this value, add a "variable"
│ block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide certain
│ "global" settings to all configurations in your organization. To reduce the
│ verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 3 other variable(s) defined
│ without being declared.
╵
╷
│ Error: Plugin did not respond
│ 
│ The plugin encountered an error, and failed to respond to the
│ plugin.(*GRPCProvider).ReadResource call. The plugin logs may contain more
│ details.
╵
╷
│ Error: Plugin did not respond
│ 
│ The plugin encountered an error, and failed to respond to the
│ plugin.(*GRPCProvider).ReadResource call. The plugin logs may contain more
│ details.
╵
╷
│ Error: Plugin did not respond
│ 
│ The plugin encountered an error, and failed to respond to the
│ plugin.(*GRPCProvider).ReadResource call. The plugin logs may contain more
│ details.
╵

Stack trace from the terraform-provider-proxmox_v2.9.14 plugin:

panic: interface conversion: interface {} is string, not float64

goroutine 85 [running]:
github.com/Telmate/proxmox-api-go/proxmox.NewConfigQemuFromApi(0xc00064b088, 0xc00064b088?)
        github.com/Telmate/proxmox-api-go@v0.0.0-20230319185744-e7cde7198cdf/proxmox/config_qemu.go:584 +0x4605
github.com/Telmate/terraform-provider-proxmox/proxmox._resourceVmQemuRead(0xc000469200, {0xb66f60?, 0xc0000881e0})
        github.com/Telmate/terraform-provider-proxmox/proxmox/resource_vm_qemu.go:1475 +0x457
github.com/Telmate/terraform-provider-proxmox/proxmox.resourceVmQemuRead(0x0?, {0xb66f60?, 0xc0000881e0?})
        github.com/Telmate/terraform-provider-proxmox/proxmox/resource_vm_qemu.go:1446 +0x25
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).read(0xdd7840?, {0xdd7840?, 0xc0001def60?}, 0xd?, {0xb66f60?, 0xc0000881e0?})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.25.0/helper/schema/resource.go:712 +0x178
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).RefreshWithoutUpgrade(0xc000190ee0, {0xdd7840, 0xc0001def60}, 0xc00012add0, {0xb66f60, 0xc0000881e0})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.25.0/helper/schema/resource.go:1015 +0x585
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ReadResource(0xc000419e90, {0xdd7840?, 0xc0001dedb0?}, 0xc0007506c0)
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.25.0/helper/schema/grpc_provider.go:613 +0x4a5
github.com/hashicorp/terraform-plugin-go/tfprotov5/tf5server.(*server).ReadResource(0xc0002b03c0, {0xdd7840?, 0xc0001de3c0?}, 0xc0004982a0)
        github.com/hashicorp/terraform-plugin-go@v0.14.3/tfprotov5/tf5server/server.go:748 +0x4b1
github.com/hashicorp/terraform-plugin-go/tfprotov5/internal/tfplugin5._Provider_ReadResource_Handler({0xc6bc20?, 0xc0002b03c0}, {0xdd7840, 0xc0001de3c0}, 0xc00018a070, 0x0)
        github.com/hashicorp/terraform-plugin-go@v0.14.3/tfprotov5/internal/tfplugin5/tfplugin5_grpc.pb.go:349 +0x170
google.golang.org/grpc.(*Server).processUnaryRPC(0xc0002581e0, {0xddb420, 0xc00031a4e0}, 0xc0002fa480, 0xc000427a40, 0x128f770, 0x0)
        google.golang.org/grpc@v1.53.0/server.go:1336 +0xd23
google.golang.org/grpc.(*Server).handleStream(0xc0002581e0, {0xddb420, 0xc00031a4e0}, 0xc0002fa480, 0x0)
        google.golang.org/grpc@v1.53.0/server.go:1704 +0xa2f
google.golang.org/grpc.(*Server).serveStreams.func1.2()
        google.golang.org/grpc@v1.53.0/server.go:965 +0x98
created by google.golang.org/grpc.(*Server).serveStreams.func1
        google.golang.org/grpc@v1.53.0/server.go:963 +0x28a

Error: The terraform-provider-proxmox_v2.9.14 plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.